#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.transitgateway.data.aws_ec2_transit_gateway_vpc_attachments.this: Refreshing state...
module.transitgateway.data.aws_route_table.this[0]: Refreshing state...
module.transitgateway.data.aws_route_table.this[1]: Refreshing state...
module.transitgateway.data.aws_route_table.this[2]: Refreshing state...
module.transitgateway.data.aws_organizations_organization.this[0]: Refreshing state...
module.transitgateway.data.aws_vpc.new_vpc_cidr[0]: Refreshing state...
module.transitgateway.data.aws_vpc.new_vpc_cidr[1]: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.transitgateway.data.aws_ec2_transit_gateway.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ec2_transit_gateway" "this"  {
      + amazon_side_asn                    = (known after apply)
      + arn                                = (known after apply)
      + association_default_route_table_id = (known after apply)
      + auto_accept_shared_attachments     = (known after apply)
      + default_route_table_association    = (known after apply)
      + default_route_table_propagation    = (known after apply)
      + description                        = (known after apply)
      + dns_support                        = (known after apply)
      + id                                 = (known after apply)
      + multicast_support                  = (known after apply)
      + owner_id                           = (known after apply)
      + propagation_default_route_table_id = (known after apply)
      + tags                               = (known after apply)
      + transit_gateway_cidr_blocks        = (known after apply)
      + vpn_ecmp_support                   = (known after apply)
    }

  # module.transitgateway.data.aws_vpc.all_vpc_cidr[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "all_vpc_cidr"  {
      + arn                     = "arn:aws:ec2:ap-southeast-1:564863080376:vpc/vpc-0c9cd8eed5980b262"
      + cidr_block              = "10.10.0.0/16"
      + cidr_block_associations = [
          + {
              + association_id = "vpc-cidr-assoc-097a36a7d6d964867"
              + cidr_block     = "10.10.0.0/16"
              + state          = "associated"
            },
        ]
      + default                 = false
      + dhcp_options_id         = "dopt-42be7124"
      + enable_dns_hostnames    = true
      + enable_dns_support      = true
      + id                      = "vpc-0c9cd8eed5980b262"
      + instance_tenancy        = "default"
      + main_route_table_id     = "rtb-06c6c182482832c46"
      + owner_id                = "564863080376"
      + tags                    = {
          + "Name" = "project-a-vpc"
        }
    }

  # module.transitgateway.data.aws_vpc.all_vpc_cidr[1] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_vpc" "all_vpc_cidr"  {
      + arn                     = "arn:aws:ec2:ap-southeast-1:564863080376:vpc/vpc-c38256a5"
      + cidr_block              = "172.31.0.0/16"
      + cidr_block_associations = [
          + {
              + association_id = "vpc-cidr-assoc-ea7c1f81"
              + cidr_block     = "172.31.0.0/16"
              + state          = "associated"
            },
        ]
      + default                 = true
      + dhcp_options_id         = "dopt-42be7124"
      + enable_dns_hostnames    = true
      + enable_dns_support      = true
      + id                      = "vpc-c38256a5"
      + instance_tenancy        = "default"
      + main_route_table_id     = "rtb-f12b7397"
      + owner_id                = "564863080376"
      + tags                    = {}
    }

  # module.transitgateway.aws_ec2_transit_gateway.this[0] will be created
  + resource "aws_ec2_transit_gateway" "this" {
      + amazon_side_asn                    = 64512
      + arn                                = (known after apply)
      + association_default_route_table_id = (known after apply)
      + auto_accept_shared_attachments     = "disable"
      + default_route_table_association    = "disable"
      + default_route_table_propagation    = "disable"
      + dns_support                        = "enable"
      + id                                 = (known after apply)
      + multicast_support                  = "disable"
      + owner_id                           = (known after apply)
      + propagation_default_route_table_id = (known after apply)
      + tags                               = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW"
        }
      + tags_all                           = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW"
        }
      + vpn_ecmp_support                   = "enable"
    }

  # module.transitgateway.aws_ec2_transit_gateway_route.default_cidr[0] will be created
  + resource "aws_ec2_transit_gateway_route" "default_cidr" {
      + blackhole                      = false
      + destination_cidr_block         = "10.10.0.0/16"
      + id                             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_route.default_cidr[1] will be created
  + resource "aws_ec2_transit_gateway_route" "default_cidr" {
      + blackhole                      = false
      + destination_cidr_block         = "172.31.0.0/16"
      + id                             = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_route_table.this[0] will be created
  + resource "aws_ec2_transit_gateway_route_table" "this" {
      + arn                             = (known after apply)
      + default_association_route_table = (known after apply)
      + default_propagation_route_table = (known after apply)
      + id                              = (known after apply)
      + tags                            = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW-route-table"
        }
      + tags_all                        = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW-route-table"
        }
      + transit_gateway_id              = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_route_table_association.this[0] will be created
  + resource "aws_ec2_transit_gateway_route_table_association" "this" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_route_table_association.this[1] will be created
  + resource "aws_ec2_transit_gateway_route_table_association" "this" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_route_table_propagation.this[0] will be created
  + resource "aws_ec2_transit_gateway_route_table_propagation" "this" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_route_table_propagation.this[1] will be created
  + resource "aws_ec2_transit_gateway_route_table_propagation" "this" {
      + id                             = (known after apply)
      + resource_id                    = (known after apply)
      + resource_type                  = (known after apply)
      + transit_gateway_attachment_id  = (known after apply)
      + transit_gateway_route_table_id = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_vpc_attachment.this[0] will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + subnet_ids                                      = [
          + "subnet-040c7e4a784ed5f68",
          + "subnet-04a63935d18f0b311",
        ]
      + tags                                            = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW<-vpc-0c9cd8eed5980b262"
        }
      + tags_all                                        = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW<-vpc-0c9cd8eed5980b262"
        }
      + transit_gateway_default_route_table_association = (known after apply)
      + transit_gateway_default_route_table_propagation = (known after apply)
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = "vpc-0c9cd8eed5980b262"
      + vpc_owner_id                                    = (known after apply)
    }

  # module.transitgateway.aws_ec2_transit_gateway_vpc_attachment.this[1] will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
      + appliance_mode_support                          = "disable"
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + subnet_ids                                      = [
          + "subnet-5e78c138",
        ]
      + tags                                            = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW<-vpc-c38256a5"
        }
      + tags_all                                        = {
          + "CreatedByTerrform" = "true"
          + "Name"              = "transitGW<-vpc-c38256a5"
        }
      + transit_gateway_default_route_table_association = (known after apply)
      + transit_gateway_default_route_table_propagation = (known after apply)
      + transit_gateway_id                              = (known after apply)
      + vpc_id                                          = "vpc-c38256a5"
      + vpc_owner_id                                    = (known after apply)
    }

  # module.transitgateway.aws_route.with_destination_routes["vpc-0c9cd8eed5980b262.subnet-040c7e4a784ed5f68.172.31.32.0/20"] will be created
  + resource "aws_route" "with_destination_routes" {
      + destination_cidr_block = "172.31.32.0/20"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0756202060a1ad43e"
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.transitgateway.aws_route.with_destination_routes["vpc-0c9cd8eed5980b262.subnet-04a63935d18f0b311.172.31.32.0/20"] will be created
  + resource "aws_route" "with_destination_routes" {
      + destination_cidr_block = "172.31.32.0/20"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0af206f562131c35d"
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.transitgateway.aws_route.with_destination_routes["vpc-c38256a5.subnet-5e78c138.10.10.128.0/20"] will be created
  + resource "aws_route" "with_destination_routes" {
      + destination_cidr_block = "10.10.128.0/20"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-f12b7397"
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.transitgateway.aws_route.with_destination_routes["vpc-c38256a5.subnet-5e78c138.10.10.144.0/20"] will be created
  + resource "aws_route" "with_destination_routes" {
      + destination_cidr_block = "10.10.144.0/20"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-f12b7397"
      + state                  = (known after apply)
      + transit_gateway_id     = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

*Pusher: @debu99, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*